#+property: header-args:spice :cache yes :noweb yes :exports both :results output raw
#+latex_class_options: [fleqn]
#+latex_header: \usepackage{homework}
#+export_exclude_tags: noexport


#+title: EE341 Fall 2019 HW \jobname
#+author: Lewis Collum
#+date: Updated: \today
[[https://github.com/LewisCollum/microelectronics][github.com/LewisCollum/microelectronics]]

** Error
#+name: getValueFromFile
#+BEGIN_SRC python :var filename="./figure/3_maxdifference" :exports none :results output raw
with open(filename) as f:
    print(f.readline().rstrip())
#+END_SRC   

\[Error = \frac{|graphical - theoretical|}{theoretical}\]

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output raw :var graphical=getValueFromFile(file="./figure/3_maxdifference") :var theoretical=getValueFromFile(file="./figure/3_difference") :cache yes
theoretical = 2*5 - float(theoretical)
graphical = float(graphical)
print(f"Error = {(graphical - theoretical)*100/theoretical:.3}%")
#+END_SRC

#+RESULTS[f2c6c52a5138dcd56a7d171af50bdd227c34e09f]:
Error = 1.15e+03%

The error was obtained from analogous simulation results and therefore
is approximately 0%.

* \(V_r\) and \(i_{Dmax}\) for \(10\si{\mu F}\) and \(150\si{\mu F}\) Capacitor Circuits
#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output text :exports both
import math
from recordtype import recordtype
PeakRectifier = recordtype('PeakRectifier', ['vp', 'f', 'c', 'r'])

vs = 5
vd = 0.75

capacitors = [10e-6, 150e-6]
vrSim = [1.12335, 0.099591]
idmaxSim = [0.0130566, 0.0327946]
peakRectifier = PeakRectifier(
    vp = vs - vd,
    f = 60,
    c = None,
    r = 2e3)

def rippleVoltage(pr: PeakRectifier) -> float:
    return pr.vp / 2 / pr.f / pr.c / pr.r

def diodeMaxCurrent(pr: PeakRectifier) -> float:
    return (pr.vp / pr.r) * (1 + 2*math.pi*math.sqrt(pr.vp / 2 / rippleVoltage(pr)))

for i, capacitor in enumerate(capacitors):
    peakRectifier.c = capacitor
    vr = rippleVoltage(peakRectifier)
    idmax = diodeMaxCurrent(peakRectifier)
    print((f"{peakRectifier.c}F:\n"
           f"  Ripple Voltage (Theory) = {vr:.5}\n"
           f"  Ripple Voltage (Sim) = {vrSim[i]:.5}\n"
           f"  Ripple Voltage Error = {abs(vr - vrSim[i])*100/vrSim[i]:.3}%\n\n"
           f"  Diode Current Max (Theory) = {idmax:.5}\n"
           f"  Diode Current Max (Sim) = {idmaxSim[i]:.5}\n"
           f"  Diode Max Current Error = {abs(idmax - idmaxSim[i])*100/idmaxSim[i]:.3}%\n"))
#+END_SRC

#+RESULTS:
#+begin_example
1e-05F:
  Ripple Voltage (Theory) = 1.770833333333333
  Ripple Voltage (Sim) = 1.12335
  Ripple Voltage Error = 57.6%

  Diode Current Max (Theory) = 0.01675112988434097
  Diode Current Max (Sim) = 0.0130566
  Diode Max Current Error = 28.3%

0.00015F:
  Ripple Voltage (Theory) = 0.11805555555555555
  Ripple Voltage (Sim) = 0.099591
  Ripple Voltage Error = 18.5%

  Diode Current Max (Theory) = 0.058771757461519164
  Diode Current Max (Sim) = 0.0327946
  Diode Max Current Error = 79.2%
#+end_example

The high amount error is possibly due to our simulation components
being less ideal than theoretical components.

